Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSingleCurveLoopsAsSplitters Property
 Curve elements forming a single curve loop cannot be used as splitters and are ignored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceSingleCurveLoopsAsSplitters { get; }
Public Shared ReadOnly Property DividedSurfaceSingleCurveLoopsAsSplitters As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceSingleCurveLoopsAsSplitters {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceSingleCurveLoopsAsSplitters : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace